import numpy as np
from scipy.stats import ks_2samp, shapiro

# Крок 1: Згенеруйте вибірку z_1 з 1000 значень зі стандартного нормального розподілу, використовуючи центральну граничну теорему (ЦГТ)
z_1 = np.random.normal(0, 1, 1000)

# Крок 2: Згенеруйте вибірки z_2 та z_3 з 1000 значень із заданого розподілу за допомогою перетворення Бокса-Мюллера
u1 = np.random.uniform(0, 1, 1000)
u2 = np.random.uniform(0, 1, 1000)
z_2 = np.sqrt(-2 * np.log(u1)) * np.cos(2 * np.pi * u2)
z_3 = np.sqrt(-2 * np.log(u1)) * np.sin(2 * np.pi * u2)
z_4 = np.random.normal(0, 1, 1000)

# Створимо вектор, який складається з 1000 векторів по 5 елементів
vector = np.vstack((z_1[:5], z_2[:5], z_3[:5], z_4[:5],))
rest = []
for i in range(1000):
    temp_vector = np.vstack((z_1[i], z_2[i], z_3[i], z_4[i],))
    rest.append(temp_vector)

# Крок 3: Проведемо порівняння і перевірку узгодженості розподілів з використанням критерію Колмогорова-Смірнова для z_1, z_2, z_3, z_4, z_5 та з теоретичним розподілом
ks_statistic, ks_pvalue_z1 = ks_2samp(z_1, np.random.normal(0, 1, 1000))
ks_statistic, ks_pvalue_z2 = ks_2samp(z_2, np.random.normal(0, 1, 1000))
ks_statistic, ks_pvalue_z3 = ks_2samp(z_3, np.random.normal(0, 1, 1000))
ks_statistic, ks_pvalue_z4 = ks_2samp(z_4, np.random.normal(0, 1, 1000))


# Крок 4: Проведемо порівняння і перевірку узгодженості розподілу з використанням тесту Шапіро-Вілка для rest
shapiro_values_rest = [shapiro(x.flatten()) for x in rest]

# Крок 4: Генеруємо вектор з нормальним розподілом, використовуючи відому коваріаційну матрицю K та середній вектор M
K = np.array([[186, 111, 23, 97], [111, 143, 95, 78], [23, 95, 151, 132], [97, 78, 132, 230]])
M = np.array([1, -5, 3, 2])

# Знайдемо математичне сподівання кожного створеного вектора за допомогою вектора M
means = []
for r in rest:
    mean = M + np.dot(np.linalg.inv(K), np.sum(r - M, axis=1))
    means.append(mean)

# Перевіримо узгодженість отриманих математичних сподівань з вектором M
ks_statistic_means, ks_pvalue_means = ks_2samp(means, M)

# Виведення результатів
print("Критерій Колмогорова-Смірнова для z_1:", ks_pvalue_z1)
print("Критерій Колмогорова-Смірнова для z_2:", ks_pvalue_z2)
print("Критерій Колмогорова-Смірнова для z_3:", ks_pvalue_z3)
print("Критерій Колмогорова-Смірнова для z_4:", ks_pvalue_z4)
print("Критерій Шапіро-Вілка для rest:", shapiro_values_rest)
print("Критерій Колмогорова-Смірнова для мат. сподівань:", ks_pvalue_means)

# Критерій Колмогорова-Смірнова для z_1: 0.19957365535779528
# Критерій Колмогорова-Смірнова для z_2: 0.4659595288557257
# Критерій Колмогорова-Смірнова для z_3: 0.6101664688189142
# Критерій Колмогорова-Смірнова для z_4: 0.8595454206943325
# ShapiroResult(statistic=0.8602344438471801, pvalue=0.2610549678725763), ShapiroResult(statistic=0.8644017487868875, pvalue=0.27628227985901244)
# Критерій Колмогорова-Смірнова для мат. сподівань: [0.99300699 0.995005   0.997003   0.995005  ]
